In [3]:
import pandas as pd
data = [1,2,3,4,5,6,7,8,9]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
import pandas as pd

# Correctly define a dictionary
data1 = {'a': 1, 'b': 3, 'c': 5}

# Create a pandas Series from the dictionary
series_dic = pd.Series(data1)

# Display the Series
print(series_dic)
print(type(series_dic))

a    1
b    3
c    5
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
data = [10 , 20 , 30]

index = ['a' , 'b' ,'c']
pd.Series(data , index)

a    10
b    20
c    30
dtype: int64

In [25]:
## Data Frame 
import pandas as pd

# Use double backslashes to escape the backslash in the file path
data = pd.read_csv('ATM_CUSTOMER.csv')

# Display the data

df = pd.DataFrame(data)
print("Head of Data Frame")
print(df.head())
print("Tail of Data Frame")
print(df.tail())

print("Location of 0th element")
print(df.loc[0])

Head of Data Frame
            Name  Account Number   PIN  Balance
0   Grace Yellow           45042  5185    69553
1     Jane Smith           85965  3190    64865
2  Alice Johnson           48360  1610    21162
3   Grace Yellow           80624  9324    70408
4  Alice Johnson           53525  8201    28238
Tail of Data Frame
           Name  Account Number   PIN  Balance
98     John Doe           84953  9975    24869
99   Jane Smith           21239  7272    52992
100  Raju Kumar            1138  9087     7834
101  Raju Kumar            1138  9087     7834
102  Raju Kumar            1138  9087     7834
Location of 0th element
Name              Grace Yellow
Account Number           45042
PIN                       5185
Balance                  69553
Name: 0, dtype: object

In [20]:
total_amount = df['Balance'].sum()
mean_balance = df['Balance'].mean()
median_balace = df['Balance'].median()
print(total_amount)
print(mean_balance)
print(median_balace)

5260461
51072.436893203885
52297.0

In [28]:
df['Name']

0       Grace Yellow
1         Jane Smith
2      Alice Johnson
3       Grace Yellow
4      Alice Johnson
           ...
98          John Doe
99        Jane Smith
100       Raju Kumar
101       Raju Kumar
102       Raju Kumar
Name: Name, Length: 103, dtype: object

In [29]:
df.at[2 ,'Name']

'Alice Johnson'

In [35]:
print(df.iat[100,0])

Raju Kumar

In [37]:
# Data Manuplation with Data freames
import numpy as np
np.random.seed(0)

# Generate random numbers above 10,000
# Replace `len(data)` with the number of rows in your DataFrame
random_numbers = np.random.randint(10001, 20000, size=len(data))

# Add the new column to the DataFrame
data['Salary'] = random_numbers

# Save the updated DataFrame back to a CSV file
data.to_csv('C:\GITHUB COLLECTIONS\MACHINE_LEARNING\DataAnalysis\ATM_CUSTOMER.csv', index=False)

# Display the first few rows to confirm
print(data.head())

            Name  Account Number   PIN  Balance  RandomNumbers  Salary
0   Grace Yellow           45042  5185    69553          12733   12733
1     Jane Smith           85965  3190    64865          19846   19846
2  Alice Johnson           48360  1610    21162          13265   13265
3   Grace Yellow           80624  9324    70408          14860   14860
4  Alice Johnson           53525  8201    28238          19226   19226

<>:13: SyntaxWarning: invalid escape sequence '\G'
<>:13: SyntaxWarning: invalid escape sequence '\G'
C:\Users\Kirit\AppData\Local\Temp\ipykernel_12780\2870256978.py:13: SyntaxWarning: invalid escape sequence '\G'
  data.to_csv('C:\GITHUB COLLECTIONS\MACHINE_LEARNING\DataAnalysis\ATM_CUSTOMER.csv', index=False)

In [38]:
data = data.drop('RandomNumbers' , axis= 1)

data.to_csv('C:\GITHUB COLLECTIONS\MACHINE_LEARNING\DataAnalysis\ATM_CUSTOMER.csv',index = False)

print(data.head)

<bound method NDFrame.head of               Name  Account Number   PIN  Balance  Salary
0     Grace Yellow           45042  5185    69553   12733
1       Jane Smith           85965  3190    64865   19846
2    Alice Johnson           48360  1610    21162   13265
3     Grace Yellow           80624  9324    70408   14860
4    Alice Johnson           53525  8201    28238   19226
..             ...             ...   ...      ...     ...
98        John Doe           84953  9975    24869   17317
99      Jane Smith           21239  7272    52992   14306
100     Raju Kumar            1138  9087     7834   12611
101     Raju Kumar            1138  9087     7834   15532
102     Raju Kumar            1138  9087     7834   16927

[103 rows x 5 columns]>

<>:3: SyntaxWarning: invalid escape sequence '\G'
<>:3: SyntaxWarning: invalid escape sequence '\G'
C:\Users\Kirit\AppData\Local\Temp\ipykernel_12780\2815695303.py:3: SyntaxWarning: invalid escape sequence '\G'
  data.to_csv('C:\GITHUB COLLECTIONS\MACHINE_LEARNING\DataAnalysis\ATM_CUSTOMER.csv',index = False)

In [42]:
data = pd.read_csv('ATM_CUSTOMER.csv')
df = pd.DataFrame(data=data)
df.head()

            Name  Account Number   PIN  Balance  Salary
0   Grace Yellow           45042  5185    69553   12733
1     Jane Smith           85965  3190    64865   19846
2  Alice Johnson           48360  1610    21162   13265
3   Grace Yellow           80624  9324    70408   14860
4  Alice Johnson           53525  8201    28238   19226

In [43]:
# Statistical Analysis 
df.describe()

       Account Number          PIN       Balance        Salary
count      103.000000   103.000000    103.000000    103.000000
mean     56674.737864  5360.165049  51072.436893  15174.388350
std      27000.092792  2518.440184  26440.230593   2737.395976
min       1138.000000  1155.000000   5473.000000  10538.000000
25%      31936.500000  3267.500000  30378.500000  12739.500000
50%      60683.000000  5114.000000  52297.000000  15073.000000
75%      80712.500000  7365.000000  70601.500000  17341.500000
max      99436.000000  9975.000000  99937.000000  19894.000000